4_expense_manager/app/controllers/expenses_controller.rb

  def index
    @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

  def create
    @expense = Expense.new(expense_params)

    if @expense.save
---
INSERT INTO "expenses" ("title", "category", "amount", "date", "notes", "payment_method", "status", "created_at", "updated_at") VALUES ('Ютуб підписка', 'Розваги', 150.0, '2026-06-03', 'Оплата ютуб підписки', 'Картка', 1, '2026-06-01 15:05:06.543783', '2026-06-01 15:05:06.543783') RETURNING "id"

  def update
    if @expense.update(expense_params)
---
UPDATE "expenses" SET "title" = 'Вода', "amount" = 250.0, "date" = '2026-06-27', "updated_at" = '2026-06-01 15:02:46.342731' WHERE "expenses"."id" = 5

  def destroy
    @expense.destroy
---
DELETE FROM "expenses" WHERE "expenses"."id" = 1

  def set_expense
    @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = 6 LIMIT 1