5_expense_manager/app/controllers/expenses_controller.rb

  def index
    @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

  def create
    @expense = Expense.new(expense_params)

    if @expense.save
---
INSERT INTO "expenses" ("title", "category", "amount", "date", "notes", "payment_method", "status", "created_at", "updated_at", "merchant") VALUES ('Інтернет', 'Комунальні послуги', 300.0, '2026-06-19', '', 'Картка ', 0, '2026-06-03 06:20:43.655809', '2026-06-03 06:20:43.655809', NULL) RETURNING "id"

  def update
    if @expense.update(expense_params)
---
UPDATE "expenses" SET "date" = '2026-07-01', "payment_method" = 'Готівка', "updated_at" = '2026-06-03 06:38:47.428576' WHERE "expenses"."id" = 3

  def destroy
    @expense.destroy
---
DELETE FROM "expenses" WHERE "expenses"."id" = 1

  def set_expense
    @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = 1 LIMIT 1