5_expense_manager/app/views/expenses/_form.html.erb

SELECT "categories"."name" FROM "categories"
---
    <%= f.label :category, class: "form-label" %>
    <%= f.select :category,
                 Category.pluck(:name),
                 {},
                 class: "form-control" %>